In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('weather_data.csv')

In [3]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [4]:
df = pd.read_excel('weather_data.xlsx')

In [5]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [6]:
#Write df to csv
df.to_csv('new.csv')
df.to_csv('NewNoIndex.csv',index=False)

In [7]:
#Can return multiple values in a fn
def f():
    return 1,2,3,4,5

a = list(f()) #Can now do more operations coz now it's changed to list
print(f())
print(a)

(1, 2, 3, 4, 5)
[1, 2, 3, 4, 5]

In [8]:
df.to_excel('new.xlsx',sheet_name='weather_data')

In [9]:
df = pd.read_csv('weather_data_cities.csv')

In [10]:
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [11]:
g = df.groupby('city') #Groupby command as same used in SQL Db

In [12]:
g

In [13]:
for city,city_df in g:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [14]:
#Or to get specific group
g.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [15]:
g.get_group('1/1/2017')
#Gives key error coz we have already grouped by cities not day

KeyError: '1/1/2017'

In [16]:
d = df.groupby('day')

In [17]:
d.get_group('1/1/2017')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
4  1/1/2017    mumbai           90          5  Sunny
8  1/1/2017     paris           45         20  Sunny

In [18]:
#And now it works

In [19]:
print(g.max())

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [20]:
g.describe()

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

In [21]:
#Groupby is very useful cmd when it comes to print in groups

**Concatenate DF**

In [22]:
india_weather = pd.DataFrame(
{
    'city' : ['mumbai','delhi','banglore'],
    'temperature' : [32,45,30],
    'humidity' : [80,60,78]
}
)

In [23]:
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [24]:
#In general terms it';s called dictionary but in DS it's called Hashmap

In [25]:
us_weather = pd.DataFrame(
{
    'city' : ['new york','chicago','california'],
    'temperature' : [32,45,40],
    'humidity' : [42,34,78]
}
)

In [26]:
us_weather

         city  temperature  humidity
0    new york           32        42
1     chicago           45        34
2  california           40        78

In [27]:
df = pd.concat([india_weather,us_weather])

In [28]:
df

         city  temperature  humidity
0      mumbai           32        80
1       delhi           45        60
2    banglore           30        78
0    new york           32        42
1     chicago           45        34
2  california           40        78

In [29]:
df = pd.concat([india_weather,us_weather],ignore_index=True) 
#Coz concat() just copies, so to create more sense in index we do this

In [30]:
df

         city  temperature  humidity
0      mumbai           32        80
1       delhi           45        60
2    banglore           30        78
3    new york           32        42
4     chicago           45        34
5  california           40        78

In [31]:
df = pd.concat([india_weather,us_weather],axis=1)

In [32]:
df

       city  temperature  humidity        city  temperature  humidity
0    mumbai           32        80    new york           32        42
1     delhi           45        60     chicago           45        34
2  banglore           30        78  california           40        78

**Merge DF**

In [33]:
temperature_df = pd.DataFrame(
{
    'city' : ['mumbai','delhi','banglore','hydrabad'],
    'temperature' : [23,42,65,32]
}
)

In [34]:
temperature_df

       city  temperature
0    mumbai           23
1     delhi           42
2  banglore           65
3  hydrabad           32

In [35]:
humidity_df = pd.DataFrame(
{
    'city' : ['mumbai','delhi','banglore'],
    'humidity' : [65,76,54]
}
)

In [36]:
humidity_df

       city  humidity
0    mumbai        65
1     delhi        76
2  banglore        54

In [37]:
#Merge 2 df without explicitely mentioning index
df = pd.merge(temperature_df,humidity_df,on = 'city') #city is col name

In [38]:
df

       city  temperature  humidity
0    mumbai           23        65
1     delhi           42        76
2  banglore           65        54

In [39]:
#Hydrabad is in 1st df but not in 2nd df so ignored in result

In [40]:
#so how do we add hydrabad, we use outer join

In [41]:
df = pd.merge(temperature_df,humidity_df,on='city',how='outer')

In [42]:
df

       city  temperature  humidity
0    mumbai           23      65.0
1     delhi           42      76.0
2  banglore           65      54.0
3  hydrabad           32       NaN

**Numerical Indexing**

In [43]:
df = pd.DataFrame([1,2,3,4,5,6,7,89,0,0],index=[312,4,65,78,879,45,32,65,78,12])

In [44]:
df

      0
312   1
4     2
65    3
78    4
879   5
45    6
32    7
65   89
78    0
12    0

In [45]:
df = pd.DataFrame([1,2,3,4,5,6,7,89,0,0])

In [46]:
df

    0
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7  89
8   0
9   0

In [47]:
df.loc[8]
#8 is index
#Using index to access data

0    0
Name: 8, dtype: int64

In [48]:
df.iloc[8]
#We get the same value 
#Using row no

0    0
Name: 8, dtype: int64

In [49]:
df.loc[6]
#6th index val is 7

0    7
Name: 6, dtype: int64

In [50]:
df.iloc[34]
#There's no 34th row so gives index error

IndexError: single positional indexer is out-of-bounds

In [51]:
df.loc[:2]

   0
0  1
1  2
2  3

In [52]:
df.iloc[:2]

   0
0  1
1  2

In [53]:
'''
To say simply, 
.loc uses index , .iloc uses row no


iN SAME INDEX loc and ilic is same,
 in Custom index the value may change , so use accordingly

'''

'\nTo say simply, \n.loc uses index , .iloc uses row no\n\n\niN SAME INDEX loc and ilic is same,\n in Custom index the value may change , so use accordingly\n\n'